performance-test/cloudflare/cloudflare-load-test-heavy.yml
config:
  target: 'https://hubspot-forms-sveltekit.pages.dev'
  phases:
    - duration: 18
      arrivalRate: 10
      name: Large burst load
  engines:
    playwright: { aggregateByName: true }
  processor: flows/cloudflare-load-test.js
scenarios:
  - name: 'Cloudflare form submission heavy load'
    engine: playwright
    flowFunction: 'formSubmissionTest'
    flow: []